Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateTaperedWallForWallTypeError Property
 Cannot create tapered wall - the Wall Type is unacceptable. Be sure to choose a variable-thickness layer in the Wall Type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateTaperedWallForWallTypeError { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateTaperedWallForWallTypeError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateTaperedWallForWallTypeError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace